app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "This is updated post !"], ["updated_at", 2017-02-21 19:46:26 UTC], ["id", 3]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :body))